exit1 = False

while not exit1:
    a = str(input('Давай поспілкуємося) - ')).lower()
    if 'привіт' in a or 'хай' in a or 'доброго дня' in a or 'добрий день' in a:
        print('Доброго вечора, я бот з України!')
    elif 'як справи?' in a or 'що робиш?' in a or 'Чим займаєшся?' in a:
        print('Вчусь програмувати на Python!')
    elif 'фільм' in a or 'кінотеатр' in a or 'серіал' in a:
        print('Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться фільм "Невидимий гість", він просто бомба!')
    elif 'бувай' in a or 'добраніч' in a or 'гудбай' in a or 'до зустрічі' in a:
        print("Побачимось у мережі, I'll be back")
        exit1 = True
    else:
        print('Дуже цікаво, але, нажаль, ніфіга не зрозуміло :( ')
